class ScooterData:

    MAIN_URL = "https://qa-scooter.praktikum-services.ru/"
    ORDER_URL = "https://qa-scooter.praktikum-services.ru/order"
    DZEN_URL = "https://dzen.ru/?yredirect=true"

    NAME_1 = "Тест"
    SURNAME_1 = "Тестов"
    ADDRESS_1 = "Москва, ул. Льва Толстого, 16"
    METRO_1 = "Парк культуры"
    PHONE_1 = "88002509639"
    COMMENT_1 = "Hi!"

    NAME_2 = "Теста"
    SURNAME_2 = "Тестова"
    ADDRESS_2 = "Москва, ул. Садовническая, 82с2"
    METRO_2 = "Павелецкая"
    PHONE_2 = "+74957397000"
    COMMENT_2 = "Hello!"

    QUESTION_TEXT_1 = 'Сколько это стоит? И как оплатить?'
    QUESTION_TEXT_2 = 'Хочу сразу несколько самокатов! Так можно?'
    QUESTION_TEXT_3 = 'Как рассчитывается время аренды?'
    QUESTION_TEXT_4 = 'Можно ли заказать самокат прямо на сегодня?'
    QUESTION_TEXT_5 = 'Можно ли продлить заказ или вернуть самокат раньше?'
    QUESTION_TEXT_6 = 'Вы привозите зарядку вместе с самокатом?'
    QUESTION_TEXT_7 = 'Можно ли отменить заказ?'
    QUESTION_TEXT_8 = 'Я жизу за МКАДом, привезёте?'
    ANSWER_TEXT_1 = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    ANSWER_TEXT_2 = 'Пока что у нас так: один заказ — один самокат.' \
               ' Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'
    ANSWER_TEXT_3 = 'Допустим, вы оформляете заказ на 8 мая.' \
               ' Мы привозим самокат 8 мая в течение дня.' \
               ' Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру.' \
               ' Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    ANSWER_TEXT_4 = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    ANSWER_TEXT_5 = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    ANSWER_TEXT_6 = 'Самокат приезжает к вам с полной зарядкой.' \
               ' Этого хватает на восемь суток — даже если будете кататься без передышек и во сне.' \
               ' Зарядка не понадобится.'
    ANSWER_TEXT_7 = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    ANSWER_TEXT_8 = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
